app/controllers/devise/registrations_controller.rb

  def new
    @roles = Role.find(:all, :conditions => "name != 'Admin'")
---
SELECT `roles`.* FROM `roles` WHERE (name != 'Admin')

  def create
    @roles = Role.find(:all, :conditions => "name != 'Admin'")
    build_resource

    if resource.save
      role = Role.find(params['role_id'])
      @user.roles << role
---
SELECT `roles`.* FROM `roles` WHERE `roles`.`id` = 2 LIMIT 1
INSERT INTO `users` (`email`, `encrypted_password`, `reset_password_token`, `reset_password_sent_at`, `remember_created_at`, `sign_in_count`, `current_sign_in_at`, `last_sign_in_at`, `current_sign_in_ip`, `last_sign_in_ip`, `confirmation_token`, `confirmed_at`, `confirmation_sent_at`, `authentication_token`, `name`, `user_name`, `company_name`, `receive_emails`, `created_at`, `updated_at`) VALUES ('noumankhalid786@gmail.com', '$2a$10$YdWdDowxSdRrwWiLbHeuQ.7qkwWyrrtM9JlmBf.o3ppAO6B3M3wWS', NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, 'WQKc5CuMz5sAyZS1geUx', NULL, '2011-09-24 05:57:14', NULL, 'nouman', 'nouman', 'nouman', NULL, '2011-09-24 05:57:14', '2011-09-24 05:57:14')