app/views/events/_list.html.erb

SELECT `events`.* FROM `events` WHERE (LOWER(name) LIKE 'a%') ORDER BY name
---
              <td><%= event.qr_code %></td>
              <td><%= event.group_event %></td>