app/views/events/show.html.erb

<%= link_to 'Back', events_path %>
<% if @event.attendees.size < @event.number_of_tickets.to_i %>
---
SELECT COUNT(*) FROM `attendees` INNER JOIN `events_attendees` ON `attendees`.id = `events_attendees`.attendee_id WHERE ((`events_attendees`.event_id = 1))