app/controllers/events_controller.rb

  def index
#    if is_admin?
      @events = Event.all
---
SELECT `events`.* FROM `events` WHERE (user_id = 4)

  def edit
    @event = Event.find(params[:id])
---
SELECT `events`.* FROM `events` WHERE `events`.`id` = 1 LIMIT 1

  def create
    params[:event][:user_id] = current_user.id;
    @event = Event.new(params[:event])

    respond_to do |format|
      if @event.save
---
INSERT INTO `events` (`user_id`, `name`, `description`, `number_of_events`, `start_date`, `end_date`, `restrictions`, `location`, `address`, `web_address`, `number_of_tickets`, `ticket_type`, `max_order_tickets`, `keywords`, `discount_code`, `qr_code`, `group_event`, `video_link`, `created_at`, `updated_at`) VALUES (4, 'kjk', '<p>kjhk</p>', 2, '2011-09-24', '2011-09-24', '<p>csd</p>', 'asda', 'asda', 'asd', 1, 'asda', 1, '<p>asda<span style=\"white-space: pre;\"> </span></p>', NULL, NULL, 1, 'asdasd', '2011-09-24 09:11:19', '2011-09-24 09:11:19')

  def fetch_pages
    if params[:id] == "all" || params[:id].blank?
      @events = Event.all
---
SELECT `events`.* FROM `events` WHERE (LOWER(name) LIKE 'a%') ORDER BY name

  def ticket
    @event = Event.find(params[:id])
---
SELECT `events`.* FROM `events` WHERE `events`.`id` = 1 LIMIT 1

  def search
    @events = Event.where("LOWER(name) LIKE ?", "%#{params[:q].downcase}%").order("name")
---
SELECT `events`.* FROM `events` WHERE (LOWER(name) LIKE '%aa%') ORDER BY name