app/controllers/profiles_controller.rb

SELECT `profiles`.* FROM `profiles` WHERE (`profiles`.user_id = 4) LIMIT 1
---
  def show
    @profile = current_user.profile
    if @profile.blank?

INSERT INTO `profiles` (`user_id`, `hometown`, `interests`, `education`, `biography`, `photo_file_name`, `photo_content_type`, `photo_file_size`, `created_at`, `updated_at`) VALUES (4, 'cascasasdsa', '<p>asdas</p>', '<p>asdasasda</p>', '<p>asda</p>', NULL, NULL, NULL, '2011-09-24 09:09:33', '2011-09-24 09:09:33')
---
  def create
    params[:profile][:user_id] = current_user.id
    @profile = Profile.new(params[:profile])

    respond_to do |format|
      if @profile.save

SELECT `profiles`.* FROM `profiles` WHERE `profiles`.`id` = 3 LIMIT 1
UPDATE `profiles` SET `interests` = ' \r\n asdasd\r\n ', `education` = ' \r\n asdasd\r\n ', `biography` = ' \r\n asdasd\r\n ', `updated_at` = '2011-10-18 09:04:34' WHERE `profiles`.`id` = 3
---
  def update
    @profile = Profile.find(params[:id])

    respond_to do |format|
      if @profile.update_attributes(params[:profile])