app/controllers/services_controller.rb

        if !user_signed_in?

          # check if user has already signed in using this service provider and continue with sign in process if yes
          auth = Service.find_by_provider_and_uid(provider, uid)
---
SELECT `services`.* FROM `services` WHERE `services`.`provider` = 'facebook' AND `services`.`uid` = '100001818054753' LIMIT 1

            # check if this user is already registered with this email address; get out if no email has been provided
            if email != ''
              # search for a user with this email address
              existinguser = User.find_by_email(email)
              if existinguser
                # map this new login method via a service provider to an existing account if the email address is the same
                existinguser.services.create(:provider => provider, :uid => uid, :uname => name, :uemail => email)
---
SELECT 1 FROM `users` WHERE (`users`.`email` = BINARY 'noumankhalid786@gmail.com') LIMIT 1
INSERT INTO `services` (`user_id`, `provider`, `uid`, `uname`, `uemail`, `created_at`, `updated_at`) VALUES (1, 'facebook', '100001818054753', 'Nouman Khalid', 'noumankhalid786@gmail.com', '2011-09-23 22:42:05', '2011-09-23 22:42:05')
INSERT INTO `users` (`email`, `encrypted_password`, `reset_password_token`, `reset_password_sent_at`, `remember_created_at`, `sign_in_count`, `current_sign_in_at`, `last_sign_in_at`, `current_sign_in_ip`, `last_sign_in_ip`, `confirmation_token`, `confirmed_at`, `confirmation_sent_at`, `authentication_token`, `name`, `user_name`, `company_name`, `receive_emails`, `created_at`, `updated_at`) VALUES ('visitor@a.com', '$2a$10$S7YM4c36fR6KqWXqXqylkOWCSd46Qx.rct79mjfIfLjxuK2XKPRam', NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, '2011-09-27 16:45:55', NULL, NULL, NULL, NULL, NULL, NULL, '2011-09-27 16:45:56', '2011-09-27 16:45:56')


                # do not send confirmation email, we directly save and confirm the new record
                user.skip_confirmation!
                user.save!
---
UPDATE `users` SET `last_sign_in_at` = '2011-09-23 22:42:05', `current_sign_in_at` = '2011-09-23 22:42:05', `last_sign_in_ip` = '127.0.0.1', `current_sign_in_ip` = '127.0.0.1', `sign_in_count` = 1, `updated_at` = '2011-09-23 22:42:05' WHERE `users`.`id` = 1