app/controllers/tickets_controller.rb

SELECT `tickets`.* FROM `tickets` WHERE (event_is = '1')
---
  def index
    unless params[:e_id].blank?
      @tickets = Ticket.all(:conditions => ["event_id = ?",params[:e_id]])

SELECT `tickets`.* FROM `tickets` WHERE `tickets`.`id` = 1 LIMIT 1
---
  def show
    @ticket = Ticket.find(params[:id])

SELECT `tickets`.* FROM `tickets` WHERE `tickets`.`id` = 8 LIMIT 1
---
  def edit
    @ticket = Ticket.find(params[:id])

SELECT `events`.* FROM `events` WHERE `events`.`id` = 1 LIMIT 1
INSERT INTO `tickets` (`user_id`, `event_id`, `cost`, `type`, `attendee`, `barcode`, `design`, `created_at`, `updated_at`) VALUES (1, 1, 12, NULL, NULL, NULL, 'custom', '2011-09-28 01:51:38', '2011-09-28 01:51:38')
---
  def create
    params[:ticket][:event_id] = session[:eve_id]
    params[:ticket][:user_id] = current_user.id
    event = Event.find(session[:eve_id])
    unless event.blank?
      i = 0
      err = false
      while i < event.number_of_tickets.to_i  do
        @ticket = Ticket.new(params[:ticket])
        i +=1;
        unless @ticket.save

SELECT `tickets`.* FROM `tickets` WHERE `tickets`.`id` = 8 LIMIT 1
UPDATE `tickets` SET `ticket_type` = 'asasd', `updated_at` = '2011-10-18 06:46:14' WHERE `tickets`.`id` = 1
---
  def update
    @ticket = Ticket.find(params[:id])

    respond_to do |format|
      if @ticket.update_attributes(params[:ticket])